load-test/artillery.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 10
      name: Sustained load
  defaults:
    headers:
      Authorization: "Bearer {{ token }}"
  processor: ./processor.js

scenarios:
  - name: Create video requests
    flow:
      - function: setToken
      - post:
          url: "/api/videos/create"
          json:
            prompt: "A kite surfing dog at sunset"
            model: "sora-2"
          capture:
            - json: "$.video.id"
              as: "videoId"
      - think: 1
      - get:
          url: "/api/videos/status/{{ videoId }}"